#include <iostream> // подключение библиотеки (аналог импорта из пайтона) - найти некий файл, под названием iostream (input output stream - потоки ввода и вывода)
// студия ищет специальный файл в папке со студией, и внедряет его содержимое на место строки с инклюдом
using namespace std; // использование стандартного пространства имён
// std - standard (пространства имён - это именованые участки кода, которые позволяют решать конфликты имён (повторения имён) при конмадной разработке

// main - главная функция приложения, точка входа (entry point) - без этой функции код не скомпилируется! программа не запустится!
int main() {
    cout << "Hello World!\n"; // cout (сиАут) = console output (консольный вывод) - команда вывода текста на экран консоли (в чёрное окно)
// \n - new line (переход на новую строку)
}

